bruno/biometria-legacy-soap/consultar-biometria-secret-invalido.bru

meta {
  name: Consultar biometria - X-Core-Secret inválido (deve bloquear)
  type: http
  seq: 4
}

post {
  url: {{baseUrl}}/ws
  body: xml
  auth: none
}

headers {
  Content-Type: text/xml; charset=utf-8
  SOAPAction: ""
  X-Core-Secret: valor-invalido
}

body:xml {
  <?xml version="1.0" encoding="UTF-8"?>
  <soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://vivo.com.br/poc/biometria">
    <soapenv:Header/>
    <soapenv:Body>
      <tns:ConsultarBiometriaRequest>
        <tns:cpf>52998224725</tns:cpf>
      </tns:ConsultarBiometriaRequest>
    </soapenv:Body>
  </soapenv:Envelope>
}

assert {
  res.status: eq 403
  res.body: contains UNAUTHORIZED
}
